; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c1-s6-p6-a1)
(:domain logistics-strips)
(:objects a0 
          c0 
          t0 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 
          p0 p1 p2 p3 p4 p5 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (TRUCK t0)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (AIRPORT l0-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (at t0 l0-1)
    (at p0 l0-0)
    (at p1 l0-2)
    (at p2 l0-3)
    (at p3 l0-3)
    (at p4 l0-5)
    (at p5 l0-1)
    (at a0 l0-0)
)
(:goal
    (and
        (at p0 l0-3)
        (at p1 l0-1)
        (at p2 l0-3)
        (at p3 l0-4)
        (at p4 l0-5)
        (at p5 l0-2)
    )
)

  (:constraints
    (and
      (always (not (in p0 a0)))
      (always (not (in p1 a0)))
      (always (not (in p2 a0)))
      (always (not (in p3 a0)))
      (always (not (in p4 a0)))
      (always (not (in p5 a0)))
    )
  )
)

; plan
1. (load-truck p5 t0 l0-1)
   deleted: (at p5 l0-1)
   added: (in p5 t0)
   goals met: 2 of 6
2. (drive-truck t0 l0-1 l0-3 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-3)
   goals met: 2 of 6
3. (load-truck p3 t0 l0-3)
   deleted: (at p3 l0-3)
   added: (in p3 t0)
   goals met: 2 of 6
4. (drive-truck t0 l0-3 l0-4 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-4)
   goals met: 2 of 6
5. (unload-truck p3 t0 l0-4)
   deleted: (in p3 t0)
   added: (at p3 l0-4)
   goals met: 3 of 6
6. (drive-truck t0 l0-4 l0-3 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-3)
   goals met: 3 of 6
7. (drive-truck t0 l0-3 l0-2 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-2)
   goals met: 3 of 6
8. (unload-truck p5 t0 l0-2)
   deleted: (in p5 t0)
   added: (at p5 l0-2)
   goals met: 4 of 6
9. (load-truck p1 t0 l0-2)
   deleted: (at p1 l0-2)
   added: (in p1 t0)
   goals met: 4 of 6
10. (drive-truck t0 l0-2 l0-3 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-3)
   goals met: 4 of 6
11. (drive-truck t0 l0-3 l0-0 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-0)
   goals met: 4 of 6
12. (load-truck p0 t0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 t0)
   goals met: 4 of 6
13. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 4 of 6
14. (unload-truck p0 t0 l0-3)
   deleted: (in p0 t0)
   added: (at p0 l0-3)
   goals met: 5 of 6
15. (drive-truck t0 l0-3 l0-1 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-1)
   goals met: 5 of 6
16. (unload-truck p1 t0 l0-1)
   deleted: (in p1 t0)
   added: (at p1 l0-1)
   goals met: 6 of 6
